{
  "Global reach, local impact.": "Alcance global, impacto local.",
  "This is our guiding principle, representing our commitment to making a positive difference on a global scale through individual actions at the local level. We firmly believe that even the smallest actions can have far-reaching effects, and we strive to be a catalyst for change in our interconnected world.": "Este es nuestro principio rector, que representa nuestro compromiso de marcar una diferencia positiva a escala mundial a través de acciones individuales a nivel local. Creemos firmemente que incluso las acciones más pequeñas pueden tener efectos de gran alcance y nos esforzamos por ser un catalizador del cambio en nuestro mundo interconectado.",
  "Welcome to our packaging company, where we specialize in providing innovative and high-quality packaging solutions for businesses of all sizes. We believe in the importance of sustainability and strive to make our packaging as eco-friendly as possible. We use recyclable materials and employ sustainable manufacturing processes to minimize our impact on the environment.": "Bienvenido a nuestra empresa de embalaje, donde nos especializamos en brindar soluciones de embalaje innovadoras y de alta calidad para empresas de todos los tamaños. Creemos en la importancia de la sostenibilidad y nos esforzamos para que nuestros envases sean lo más ecológicos posible. Utilizamos materiales reciclables y empleamos procesos de fabricación sostenibles para minimizar nuestro impacto en el medio ambiente.",
  "PACK WITH US": "EMPAQUE CON NOSOTROS",
  "Why to choose us.": "Por qué elegirnos.",
  "Choosing our packaging means making a positive contribution to the planet. We believe in the power of collective action, and by opting for our eco-friendly materials, you join us in reducing waste and preserving natural resources. Together, we can create a more sustainable future.": "Elegir nuestro packaging significa hacer una contribución positiva al planeta. Creemos en el poder de la acción colectiva y, al optar por nuestros materiales ecológicos, te unes a nosotros para reducir los residuos y preservar los recursos naturales. Juntos, podemos crear un futuro más sostenible.",
  "At BENZ Packaging, we believe in fostering a culture of growth and development. We provide ample opportunities for professional advancement, encouraging our team members to expand their knowledge, skills, and expertise. As we continue to explore new avenues in the packaging industry, your contributions will play a vital role in shaping the future of our organization.": "En BENZ Packaging creemos en fomentar una cultura de crecimiento y desarrollo. Brindamos amplias oportunidades para el avance profesional, alentando a los miembros de nuestro equipo a ampliar sus conocimientos, habilidades y experiencia. A medida que continuamos explorando nuevas vías en la industria del empaque, sus contribuciones desempeñarán un papel vital en la configuración del futuro de nuestra organización.",
  "JOIN OUR TEAM": "UNETE A NUESTRO EQUIPO",
  "LEARN MORE": "APRENDE MÁS  ",
  "Our team members work tirelessly alongside our clients, partners, and subcontractors to push the boundaries of the packaging industry. We appreciate every opportunity we're given to take on a new project and bring it to life.": "Los miembros de nuestro equipo trabajan incansablemente junto a nuestros clientes, socios y subcontratistas para ampliar los límites de la industria del embalaje. Apreciamos cada oportunidad que se nos brinda para asumir un nuevo proyecto y darle vida.",
  "Manufacturing Units": "Unidades de Fabricación  ",
  "Warehouses": "Almacenes  ",
  "Happy Customers": "Clientes felices  ",
  "Products": "Productos",
  "INDUSTRIAL": "INDUSTRIAL",
  "Anti - Humidity": "Anti - Humedad  ",
  "Anti - Corrosion": "Anticorrosión  ",
  "Handling": "Manejo",
  "Traditional Packaging": "Empaque Tradicional  ",
  "Automobile": "Automóvil  ",
  "Military": "Militar  ",
  "Aerospace": "Aeroespacial",
  "Electronics": "Electrónica  ",
  "Manufacturing units play a vital role in creating products that cater to the needs of consumers": "Las unidades de fabricación juegan un papel vital en la creación de productos que satisfagan las necesidades de los consumidores.",
  "Warehouses are essential facilities for storing and organizing goods before they are distributed to customers": "Los almacenes son instalaciones esenciales para almacenar y organizar los productos antes de distribuirlos a los clientes.",
  "Happy customers are the lifeblood of any successful business.": "Los clientes felices son el alma de cualquier negocio exitoso.",
  "Products are goods or services that are created and offered for sale to meet the needs and wants of customers.": "Los productos son bienes o servicios que se crean y ofrecen a la venta para satisfacer las necesidades y deseos de los clientes.",
  "View All Secondary Products": "VER TODOS LOS PRODUCTOS SECUNDARIOS  ",
  "Industries to meet your needs.": "Industrias para satisfacer sus necesidades.",
  "Our packaging products are environmentally conscious, innovative, and cater to a variety of industries.": "  Nuestros productos de embalaje son respetuosos con el medio ambiente, innovadores y se adaptan a una variedad de industrias.",
  "Our packaging solutions for the automobile industry provide optimal protection and efficiency for transportation and storage of vehicle parts and components.": "Nuestras soluciones de embalaje para la industria del automóvil proporcionan una protección y eficiencia óptimas para el transporte y almacenamiento de piezas y componentes de vehículos.",
  "View All Industries": "VER TODAS LAS INDUSTRIAS  ",
  "News & Blogs": "NOTICIAS Y BLOGS  ",
  "NEWS": "NOTICIAS  ",
  "Benz residue-free VCI Film protection allows for constant inspection.": "La protección de película VCI sin residuos de Benz permite una inspección constante.",
  "BENZ Packaging is the leading manufacturer and supplier of Industrial Supplies & Packaging products including Tapes, Strapping Solutions, and Sealing & Wrapping Machines.": "BENZ Packaging es el fabricante y proveedor líder de suministros industriales y productos de embalaje, incluidas cintas, soluciones de flejado y máquinas de sellado y embalaje.",
  "LATEST NEWS": "ÚLTIMAS NOTICIAS  ",
  "BENZ Packaging introduces new sustainable packaging solutions.": "BENZ Packaging presenta nuevas soluciones de embalaje sostenible.",
  "CONTACT US": "CONTÁCTENOS  ",
  "What people love about us.": "Lo que la gente ama de nosotros.",
  "Our customers appreciate our dedication to sustainability and value our eco-conscious approach. By choosing BENZ Packaging, you join us in making a positive impact on the environment.": "Nuestros clientes aprecian nuestra dedicación a la sostenibilidad y valoran nuestro enfoque ecológico. Al elegir BENZ Packaging, se une a nosotros para generar un impacto positivo en el medio ambiente.",
  "Frequently asked questions": "Preguntas frecuentes  ",
  "Everything you need to know about the product and billing.": "Todo lo que necesitas saber sobre mercadería y facturación.",
  "How does keeping cleaning solutions and metalworking fluids clean prevent corrosion?": "¿Cómo previenen la corrosión los tratamientos de limpieza y refrigeración?",
  "By eliminating small metal particles (dirt or dwarf) and ensuring proper washing, galvanic corrosion and rust formation underneath the particles can be prevented.": "eliminando pequeñas partículas de metal (suciedad o escombros) y verifique que se haya lavado correctamente. evitando así la corrosión galvánica y la oxidación de subpartículas.",
  "Why is maintaining the pH of cleaning solutions important for corrosion protection?": "¿Por qué es importante mantener el pH de las soluciones de limpieza para la protección contra la corrosión?",
  "Maintaining a pH of at least 9.0 protects ferrous metals from corrosion, while a pH of 7-7.5 is suitable for non-ferrous metals like brass and bronze. Improperly washed parts can lead to galvanic corrosion and rust formation.": "Mantener un pH de al menos 9,0 protege a los metales ferrosos de la corrosión, mientras que un pH de 7 a 7,5 es adecuado para metales no ferrosos como el latón y el bronce. Las piezas mal lavadas pueden provocar corrosión galvánica y formación de óxido.",
  "Why should I switch to deionized or distilled water in cutting or cleaning fluids?": "¿Por qué debo cambiar a agua desionizada o destilada en los fluidos de corte o limpieza?",
  "Deionized or distilled water helps prevent contaminants that can contribute to corrosion, ensuring better protection for metal parts.": "El agua desionizada o destilada ayuda a prevenir los contaminantes que pueden contribuir a la corrosión, lo que garantiza una mejor protección de las piezas metálicas.",
  "What is the recommended method for drying metal parts after cleaning?": "¿Cuál es el método recomendado para secar las piezas metálicas después de la limpieza?",
  "Placing the parts in a wire basket allows for effective drying, preventing corrosion caused by vibratory action or forced air. It is important not to stack the parts until they are completely dry to avoid galvanic corrosion.": "La colocación de las piezas en una canasta de alambre permite un secado efectivo, evitando la corrosión causada por la acción vibratoria o el aire forzado. Es importante no apilar las piezas hasta que estén completamente secas para evitar la corrosión galvánica.",
  "How can I protect metal parts from industrial air contaminants and heat treatment byproducts?": "¿Cómo puedo proteger las piezas metálicas de los contaminantes del aire industrial y los subproductos del tratamiento térmico?",
  "To protect against industrial air contaminants and heat treatment byproducts, cover the metal parts with BENZ Packaging VCI paper or VCI poly bags. These protective materials shield the parts from oxygen and contaminants.": "Para protegerse contra los contaminantes industriales del aire y los subproductos del tratamiento térmico, cubra las partes metálicas con papel VCI de BENZ Packaging o bolsas de polietileno VCI. Estos materiales protectores protegen las piezas del oxígeno y los contaminantes.",
  "How do temperature and humidity fluctuations impact corrosion?": "¿Cómo afectan las fluctuaciones de temperatura y humedad a la corrosión?",
  "Fluctuations in temperature and humidity, even by 10ºC, can cause condensation, accelerating the corrosion process. Maintaining consistent temperature and humidity levels is crucial for corrosion prevention.": "Las fluctuaciones de temperatura y humedad, incluso de 10ºC, pueden provocar condensación, acelerando el proceso de corrosión. Mantener niveles constantes de temperatura y humedad es crucial para la prevención de la corrosión.",
  "What measures can I take to maintain lower temperatures and humidity levels?": "¿Qué medidas puedo tomar para mantener temperaturas y niveles de humedad más bajos?",
  "Installing climate controls, air conditioning, and dehumidifiers can help maintain lower temperatures and humidity levels. Additionally, using VCI bags or VCI paper to enclose metal parts quickly provides an extra layer of protection.": "La instalación de controles de temperatura, aire acondicionado y deshumidificadores puede ayudar a mantener temperaturas y niveles de humedad más bajos. Además, el uso de bolsas VCI o papel VCI para encerrar piezas metálicas proporciona rápidamente una capa adicional de protección.",
  "Why is it important to create a barrier between metal parts and wood or corrugated boxes?": "¿Por qué es importante crear una barrera entre las piezas de metal y las cajas de madera o corrugado?",
  "Direct contact between metal parts and wood or corrugated boxes can lead to galvanic corrosion. Using a VCI poly bag or VCI paper to line the boxes creates a protective barrier, preventing corrosion.": "El contacto directo entre piezas de metal y madera o cajas de cartón corrugado puede provocar corrosión galvánica. El uso de una bolsa de polietileno VCI o papel VCI para forrar las cajas crea una barrera protectora que evita la corrosión.",
  "How should I use VCI products effectively?": "¿Cómo debo usar los productos VCI de manera efectiva?",
  "It is crucial to follow the manufacturer's instructions when using VCI products. Consulting with experts like BENZ Packaging can help design a VCI system tailored to your application, ensuring proper usage and optimal corrosion protection.": "Es crucial seguir las instrucciones del fabricante al usar productos VCI. Consultar con expertos como BENZ Packaging puede ayudar a diseñar un sistema VCI adaptado a su aplicación, lo que garantiza un uso adecuado y una protección óptima contra la corrosión.",
  "How long can metal parts remain corrosion-free when packaged with BENZ Packaging VCI Paper or VCI Poly bags?": "¿Cuánto tiempo pueden las piezas metálicas permanecer libres de corrosión cuando se empaquetan con bolsas de papel VCI o de polietileno VCI de BENZ Packaging?",
  "When properly packaged with BENZ Packaging VCI Paper or VCI Poly bags, metal parts can stay corrosion-free for years, ensuring their long-term protection.": "Cuando se empaquetan correctamente con bolsas de papel VCI o de polietileno VCI de BENZ Packaging, las piezas metálicas pueden permanecer libres de corrosión durante años, lo que garantiza su protección a largo plazo.",
  "What sealing options are available for maintaining packaging integrity?": "¿Qué opciones de sellado están disponibles para mantener la integridad del empaque?",
  "BENZ Packaging offers various sealing options, including heat sealing and zip-lock closures, to ensure airtight packaging and prevent the ingress of moisture, oxygen, and contaminants.": "BENZ Packaging ofrece varias opciones de sellado, incluido el termosellado y los cierres zip-lock, para garantizar un embalaje hermético y evitar la entrada de humedad, oxígeno y contaminantes.",
  "Yes, BENZ Packaging offers custom packaging solutions tailored to different types of metal parts. This includes specialized shapes, sizes, and materials designed to provide optimal protection during storage and transportation.": "Sí, BENZ Packaging ofrece soluciones de embalaje personalizadas adaptadas a diferentes tipos de piezas metálicas. Esto incluye formas, tamaños y materiales especializados diseñados para brindar una protección óptima durante el almacenamiento y el transporte.",
  "Can BENZ Packaging provide custom packaging solutions?": "¿BENZ Packaging puede proporcionar soluciones de embalaje personalizadas?",
  "How can I assess the condition of packaged metal parts for corrosion?": "¿Cómo puedo evaluar el estado de corrosión de las piezas metálicas empaquetadas?",
  "Regular inspections of packaged metal parts can help identify any signs of corrosion or damage. Implementing a quality control process ensures that packaging materials and methods effectively preserve the parts' condition.": "Las inspecciones periódicas de las piezas metálicas empaquetadas pueden ayudar a identificar cualquier signo de corrosión o daño. La implementación de un proceso de control de calidad garantiza que los materiales y métodos de empaque conserven de manera efectiva el estado de las piezas.",
  "Does BENZ Packaging offer eco-friendly packaging options?": "¿BENZ Packaging ofrece opciones de embalaje ecológicas?",
  "Yes, BENZ Packaging provides eco-friendly packaging solutions, such as recyclable and biodegradable materials, to support sustainable packaging practices.": "Sí, BENZ Packaging ofrece soluciones de embalaje ecológicas, como materiales reciclables y biodegradables, para respaldar prácticas de embalaje sostenibles.",
  "How important is labeling on packaging?": "¿Qué importancia tiene el etiquetado en los envases?",
  "Proper labeling on packaging provides essential information, including part identification, handling instructions, and storage conditions. Clear and visible labeling ensures correct handling and prevents potential damage during transportation and storage.": "El etiquetado adecuado en el empaque brinda información esencial, incluida la identificación de las piezas, las instrucciones de manejo y las condiciones de almacenamiento. El etiquetado claro y visible garantiza un manejo correcto y evita posibles daños durante el transporte y el almacenamiento.",
  "Is employee training available for proper packaging procedures?": "¿Hay capacitación disponible para los empleados sobre los procedimientos de empaque adecuados?",
  "Yes, BENZ Packaging can provide training and educational resources to help train employees on proper packaging procedures, ensuring consistency and quality.": "Sí, BENZ Packaging puede brindar capacitación y recursos educativos para ayudar a capacitar a los empleados en los procedimientos de empaque adecuados, asegurando la consistencia y la calidad.",
  "Can BENZ Packaging assist in reviewing and optimizing packaging strategies?": "¿Puede BENZ Packaging ayudar a revisar y optimizar las estrategias de empaque?",
  "Yes, BENZ Packaging offers guidance and support in reviewing and enhancing packaging processes to maximize protection for metal parts. Regular assessments help identify areas for improvement and optimize packaging performance.": "Sí, BENZ Packaging ofrece orientación y apoyo en la revisión y mejora de los procesos de embalaje para maximizar la protección de las piezas metálicas. Las evaluaciones periódicas ayudan a identificar áreas de mejora y optimizar el rendimiento del embalaje. ",
  "How can I provide additional protection against mechanical damage during transportation?": "¿Cómo puedo proporcionar protección adicional contra daños mecánicos durante el transporte?",
  "Using cushioning materials such as foam inserts or bubble wrap provides additional protection against impact during handling and transportation, reducing the risk of mechanical damage to metal parts.": "El uso de materiales de amortiguación, como inserciones de espuma o plástico de burbujas, brinda protección adicional contra impactos durante la manipulación y el transporte, lo que reduce el riesgo de daños mecánicos en las piezas metálicas.",
  "What should I consider when selecting packaging materials for long-term storage and transportation?": "¿Qué debo tener en cuenta al seleccionar materiales de embalaje para almacenamiento y transporte a largo plazo?",
  "When considering the duration of storage and transportation, BENZ Packaging can recommend packaging solutions with extended corrosion protection capabilities, ensuring the parts remain corrosion-free for longer periods.": "Al considerar la duración del almacenamiento y el transporte, BENZ Packaging puede recomendar soluciones de empaque con capacidades extendidas de protección contra la corrosión, lo que garantiza que las piezas permanezcan libres de corrosión durante períodos más prolongados.  ",
  "How should I manage the inventory of packaged metal parts?": "¿Cómo debo gestionar el inventario de piezas metálicas embaladas?",
  "Proper inventory management and rotation are essential to prevent prolonged storage of metal parts. Regularly checking and using the oldest packaged parts first minimizes the risk of corrosion due to extended storage periods.": "La gestión y la rotación adecuadas del inventario son esenciales para evitar el almacenamiento prolongado de piezas metálicas. Revisar y usar regularmente las piezas empaquetadas más antiguas primero minimiza el riesgo de corrosión debido a períodos prolongados de almacenamiento.  ",

  "Still have questions?": "¿Todavía tienes preguntas?  ",
  "Can’t find the answer you’re looking for? Please chat to our friendly team.": "¿No encuentras la respuesta que buscas? Por favor chatee con nuestro amable equipo.  ",
  "Get In Touch": "Ponerse en contacto  ",
  "Subscribe to our newsletter": "Suscríbete a nuestro boletín",
  "Subscribe Now": "Suscríbase ahora  ",
  "Your packaging partner for your all packaging needs.": "Su socio de embalaje para todas sus necesidades de embalaje.  ",
  "CONTACT": "CONTACTO  ",
  "BENZ Packaging Solutions Pvt. Ltd.83, Sector - 5, IMT Manesar, Gurgaon - 122050 INDIA": "Soluciones de embalaje BENZ SA Ltd.83, Sector - 5, IMT Manesar, Gurgaon - 122050 INDIA",
  "Email:": "Correo electrónico :  ",
  "Web:": "Web:",
  "Phone:": "Teléfono:  ",
  "INDUSTRIES": "INDUSTRIAS  ",
  "Military Applications": "Aplicaciones Militares",
  "Contract Packaging": "Embalaje de contrato  ",
  "Quick Links": "enlaces rápidos  ",
  "Home": "Hogar  ",
  "Services": "Servicios",
  "News": "Noticias  ",
  "Resources": "Recursos",
  "2022 BENZ PACKAGING All Rights Reserved": "© 2022 BENZ PACKAGING Todos los derechos reservados",
  "HOMEPAGE --------------------------> ": "ENDS -------------------------->",

  "Awards and Certifications": "Premios y Certificaciones",
  "BENZ Packaging backed by its parent company – New Sales Corporation has been in the field of packaging for over 38 years. BENZ Packaging has delivered safe and effective corrosion solutions across the globe. Our Technical Partners- Propagroup (Italy) are the leading manufactures of Protective Packaging Products and have onsite representation in over 90-plus countries, to provide seamless support wherever you require it. We can help you get over any challenging corrosion prevention need such as overseas shipping in corrosive environments to storage in high humidity conditions.": "BENZ Packaging, respaldado por su empresa matriz - New Sales Corporation, ha estado en el campo del embalaje durante más de 38 años. BENZ Packaging ha proporcionado soluciones de corrosión seguras y efectivas en todo el mundo. Nuestros socios técnicos, Propagroup (Italia), son los principales fabricantes de productos de embalaje protector y cuentan con representación en el lugar en más de 90 países para brindar un soporte continuo donde lo necesite. Podemos ayudarlo a superar cualquier necesidad desafiante de prevención de corrosión, como el envío en entornos corrosivos o el almacenamiento en condiciones de alta humedad.",
  "Benefits of working with us": "Beneficios de trabajar con nosotros",
  "Supporting you from start to finish.": "Apoyándote desde el principio hasta el final",
  "Customer Service": "Servicio al Cliente",
  "Environmental Responsibilities": "Responsabilidades Ambientales",
  "Who we are": "Quiénes somos",
  "History": "Historia",
  "Benefits": "Beneficios",
  "Awards": "Premios",
  "Our Team": "Nuestro Equipo",
  "MANAGING DIRECTOR": "DIRECTOR GENERAL",
  "Vivek Chopra": "Vivek Chopra",
  "Join Our Team": "Únete a nuestro equipo",
  "Your trusted partner for all your packaging needs.": "Tu socio de confianza para todas tus necesidades de embalaje.",
  "BENZ Packaging, supported by its parent company New Sales Corporation, boasts a rich experience of over 38 years in the packaging industry. Throughout this time, BENZ Packaging has successfully provided reliable and effective corrosion solutions worldwide. Collaborating with our esteemed Technical Partners, Propagroup from Italy, renowned manufacturers of Protective Packaging Products, we offer unparalleled support with on-site representation in over 90 countries. This ensures seamless assistance wherever you require it.": "BENZ Packaging, respaldado por su empresa matriz New Sales Corporation, cuenta con una amplia experiencia de más de 38 años en la industria del embalaje. Durante este tiempo, BENZ Packaging ha proporcionado con éxito soluciones de corrosión confiables y efectivas en todo el mundo. En colaboración con nuestros estimados socios técnicos, Propagroup de Italia, reconocidos fabricantes de productos de embalaje protector, ofrecemos un soporte sin igual con representación in situ en más de 90 países. Esto garantiza una asistencia continua donde la necesite.",
  "We specialize in addressing even the most challenging corrosion prevention requirements, including the safe transportation of goods in corrosive environments and storage in high humidity conditions. For a comprehensive corrosion management solution tailored to your specific needs, we encourage you to reach out to our dedicated BENZ Packaging Technical Representative.": "Nos especializamos en abordar incluso los requisitos de prevención de corrosión más desafiantes, que incluyen el transporte segurode mercancías en entornos corrosivos y el almacenamiento en condiciones de alta humedad. Para una solución integral de gestión de la corrosión adaptada a sus necesidades específicas, le recomendamos que se ponga en contacto con nuestro dedicado Representante Técnico de BENZ Packaging.",
  "Feel free to get in touch and discover how we can assist you.": "No dudes en ponerte en contacto y descubrir cómo podemos ayudarte.",
  "We strive to offer eco-friendly packaging solutions, minimize waste generation, and educate our customers on responsible packaging practices.": "Nos esforzamos por ofrecer soluciones de embalaje respetuosas con el medio ambiente, minimizar la generación de residuos y educar a nuestros clientes sobre prácticas de embalaje responsables.",
  "Our packaging website is committed to promoting sustainable practices and reducing the environmental impact of packaging materials.": "Nuestro sitio web de embalaje se compromete a promover prácticas sostenibles y reducir el impacto ambiental de los materiales de embalaje.",
  "ABOUT PAGE": "ENDS HERE -------------------------------------------------------->",


  "Become a Distributor": "Conviértete en Distribuidor",
  "PACKAGING TIP": "CONSEJO DE EMBALAJE",
  "Packaging Tips": "Consejos de Embalaje",
  "Packaging personnel should always wear gloves while handling metal parts.": "El personal de embalaje siempre debe usar guantes al manipular piezas de metal.",
  "view all": "Ver todo",
  "Work With Us": "Trabaja con Nosotros",
  "Packaging Facts": "Datos de Embalaje",
  "FAQ": "Preguntas Frecuentes",

  
  "1. Keep your cleaning solutions and metalworking fluids clean to reduce or eliminate small metal particles which are sometimes referred to as “dirt” or “dwarf.” Dwarf deposited on the part and not properly washed away can form a galvanic corrosion cell and rust will occur underneath the dwarf.": "1. Mantenga limpias sus soluciones de limpieza y fluidos de trabajo en metalurgia para reducir o eliminar las pequeñas partículas de metal que a veces se conocen como 'suciedad' o 'enanos'. Si los enanos depositados en la pieza no se lavan adecuadamente, pueden formar una celda de corrosión galvánica y se producirá óxido debajo de los enanos.",
  "2. Be sure to maintain cleaning solutions with a pH of at least 9.0 to protect ferrous metals from Corrosion. For non-ferrous metal parts such as brass and bronze, a pH of 7 – 7.5 should be maintained. Part and not properly washed away can create a galvanic corrosion cell and rust will occur underneath the dwarf.": "2. Asegúrese de mantener las soluciones de limpieza con un pH de al menos 9.0 para proteger los metales ferrosos de la corrosión. Para piezas de metal no ferroso como latón y bronce, se debe mantener un pH de 7 a 7.5. Si no se lavan correctamente, las partes pueden crear una celda de corrosión galvánica y se producirá óxido debajo de los enanos.",
  
  "3. If you are using water in your cutting or cleaning fluids switch to deionized or distilled water.": "3. Si está utilizando agua en sus fluidos de corte o limpieza, cambie a agua desionizada o destilada.",
  "4. Place parts in a wire basket to dry from Vibratory action or forced air can dry parts more quickly. Do not stack parts on top of each other until completely dry. Parts can corrode when stacked one on top of the other or when contacting each other. This is caused by the fluid acting as an electrolyte and forming a galvanic cell between two parts.": "4. Coloque las piezas en una cesta de alambre para que se sequen por acción vibratoria o con aire forzado, ya que esto secará las piezas más rápidamente. No apile las piezas una encima de la otra hasta que estén completamente secas. Las piezas pueden corroerse cuando se apilan una encima de la otra o cuando entran en contacto entre sí. Esto se debe a que el líquido actúa como electrolito y forma una celda galvánica entre las dos piezas.",

  "5. Keep metal parts away from industrial air contaminants such as exhaust from Forklift trucks. Keep metal parts away from heat treatment areas, as by-products from heat treating are corrosive to metal.": "5. Mantenga las piezas de metal alejadas de contaminantes del aire industriales, como el escape de los camiones de montacargas. Mantenga las piezas de metal alejadas de las áreas de tratamiento térmico, ya que los subproductos del tratamiento térmico son corrosivos para el metal.",

  "Cover all metal parts with BENZ Packaging VCI paper or BENZ Packaging VCI poly bags to protect them from oxygen and contaminants that are in the plant atmosphere.": "Recubra todas las piezas de metal con papel VCI de BENZ Packaging o bolsas de polietileno VCI de BENZ Packaging para protegerlas del oxígeno y los contaminantes presentes en la atmósfera de la planta.",

  "6. Keep temperature and relative humidity in manufacturing and shipping areas constant. Fluctuations in Temperature & Humidity (by 10ºC) can cause condensation and accelerate corrosion.": "6. Mantenga la temperatura y la humedad relativa en las áreas de fabricación y envío constantes. Las fluctuaciones en la temperatura y la humedad (en 10ºC) pueden causar condensación y acelerar la corrosión.",

  "7. Maintain lower temperatures and lower humidity levels by installing climate controls, air conditioning, and/or dehumidifiers. Also, be sure to place metal parts into VCI bags or VCI paper as quickly as possible.": "7. Mantenga temperaturas más bajas y niveles más bajos de humedad mediante la instalación de controles climáticos, aire acondicionado y/o deshumidificadores. Además, asegúrese de colocar las piezas de metal en bolsas o papel VCI lo más rápido posible.",

  "8. Be sure that metal parts do not come in direct contact with wooden pallets, corrugated boxes, or untreated paper. Create a barrier between your metal parts and any wood or corrugated boxes and/or line boxes, crates, etc. with a VCI poly bag, or VCI paper.": "8. Asegúrese de que las piezas de metal no entren en contacto directo con paletas de madera, cajas de cartón corrugado o papel sin tratar. Cree una barrera entre sus piezas de metal y cualquier caja de madera o cartón corrugado y/o forre las cajas, cajones, etc., con una bolsa de polietileno VCI o papel VCI.",

  "9. Always follow the manufacturer’s instructions when using VCI products. Consult with a VCI expert like BENZ Packaging, to design a VCI system for your specific application, and help you implement the usage of VCI products properly.": "9. Siempre siga las instrucciones del fabricante al utilizar productos VCI. Consulte con un experto en VCI como BENZ Packaging para diseñar un sistema VCI para su aplicación específica y ayudarle a implementar el uso adecuado de los productos VCI.",
  "10. And Finally, package metal parts in BENZ Packaging VCI Paper or VCI Poly bag to keep parts corrosion-free for years.": "10. Y finalmente, embale las piezas de metal en papel VCI de BENZ Packaging o en una bolsa de polietileno VCI para mantener las piezas libres de corrosión durante años.",
  
  "RESOURCE PAGE": "ENDS HERE -------------------------------------------------------->"
}
